# meta developer: @MartyyyK

import random
from .. import loader, utils

@loader.tds
class magic_ball(loader.Module):
    """Волшебный шар"""
    strings = {'name': 'Magic Ball'}

    def __init__(self):
        self.predictions = [
            "Да", "Нет", "Возможно", "Не сегодня", "Скоро", "Слишком рано", "Попробуй снова", "Это возможно",
            "Определённо да", "Лучше не спрашивать", "Шансы малы", "Слишком сложно сказать", "Даже не думай",
            "Ты это знаешь", "Не исключено", "Непредсказуемо", "Судьба неизвестна", "Конечно", "Все указывает на это",
            "Не уверен", "Скорее всего", "Время покажет", "Ты знаешь ответ", "Туманно", "Не могу сказать",
            "Ответ очевиден", "Забудь об этом", "Непонятно", "Нет сомнений", "Увы, нет", "Даже и не пытайся",
            "Прямо сейчас - нет", "Время для этого еще не пришло", "Всё получится", "Даже звезды так говорят",
            "Нужно больше усилий", "Неопределенно", "Слишком запутанно", "Точно нет", "Знаки говорят нет",
            "Ты не готов услышать ответ", "Скорее всего, да", "Всё против этого", "Сконцентрируйся и попробуй",
            "Перспективы туманны", "Не в этой жизни", "Безусловно", "Удивительно, но да", "Бессмысленно",
            "Почти наверняка", "Не рассчитывай на это", "Ожидание того стоит", "Шансы минимальны",
            "Шансы велики", "Даже не надейся", "Духи говорят да", "Жди лучшего времени", "Отличный шанс",
            "Всё говорит в пользу", "Небеса одобряют", "Ближайшее будущее покажет", "Сейчас - не подходящее время",
            "Это не для тебя", "Рассчитывай на это", "Маловероятно", "Все возможности открыты",
            "Ты найдешь путь", "Это твой шанс", "Время решит", "Слушай своё сердце", "Даже не надейся",
            "Рискни!", "Подумай дважды", "Загадка", "Почти да", "Почти нет", "Ты скоро это узнаешь",
            "Твое желание сбудется", "Возможно позже", "Жди неожиданных новостей", "Будь готов к переменам",
            "Вселенная улыбается тебе", "Этого не избежать", "Кто знает?", "Ты к этому не готов",
            "Ожидай хорошего", "Не надейся", "Да, если будешь настойчив", "Рано или поздно",
            "Это возможно", "Судьба в твоих руках", "Ожидай неожиданных событий", "Твоя интуиция подскажет",
            "Скоро откроются новые возможности", "Ты узнаешь ответ позже", "Ожидай чуда",
            "Ожидай счастливого исхода", "Жизнь преподнесёт сюрприз", "Твоё время придёт", "Держи свои намерения",
            "Все возможно с верой", "Не бойся рискнуть", "Ответ может удивить", "Ответ у тебя под носом",
            "Подумай о другом", "Все зависит от тебя", "Слушай своё сердце", "Судьба определит",
            "На данный момент - нет", "На данный момент - да", "Скорее всего нет", "Скорее всего да",
            "Это секрет", "Ты узнаешь это позже", "Ожидай сюрприза", "Продолжай и удача улыбнется",
            "Думай позитивно", "Ответ придёт со временем", "Не обращай внимания на препятствия",
            "Следуй своей интуиции", "Возможно это лучшее решение", "Путь открыт для тебя",
            "Возможности будут предоставлены", "Всё станет ясно", "Судьба на твоей стороне", 
            "Следуй за своими мечтами", "Не торопись с решением", "Все произойдёт в своё время",
            "Доверься своему сердцу", "Ответ находится в тебе", "Рассчитывай на это", "Не отвлекайся на мелочи",
            "Скоро ты получишь знак", "Ожидай наилучшего результата", "Всё решится само собой", 
            "Не зацикливайся на этом", "Продолжай идти к цели", "Всё не так просто, как кажется", 
            "Ограничь свои ожидания", "Будь готов ко всему", "Ты можешь быть удивлен",
            "Ответ ближе, чем ты думаешь", "Ожидай приятных новостей", "Это зависит от тебя",
            "Решение уже на подходе", "Твоё время настанет", "Скоро всё прояснится", 
            "Время обернётся удачей", "Все звёзды тебе улыбаются", "Ожидай сюрприза от жизни", 
            "Ответ будет неожиданным", "Будь смелее в своих намерениях", "Всё окажется лучше, чем думаешь",
            "Ты на верном пути", "Рассчитывай на поддержку", "Риски оправдаются", "Ты всё узнаешь скоро",
            "Прислушайся к себе", "Вероятность велика", "Ты близок к ответу", "Ответ впереди", 
            "Жди неожиданного", "Судьба тебя благоволит", "Будь настойчив, ответ придёт", 
            "Ты этого заслуживаешь", "Задай вопрос позже", "Открой свои горизонты", "Всё будет, как должно быть",
            "Ты об этом не пожалеешь", "Забудь прошлое и иди вперёд", "Примешь важное решение", 
            "Все шансы на успех", "Ответ неожиданен", "Верное направление", "Это стоит того",
            "Не волнуйся о результатах", "Ты заслужил это", "Скоро всё изменится к лучшему",
            "Сомнения прочь", "Тебя ждёт неожиданная удача", "Всё зависит от твоего выбора",
            "Тайна скоро раскроется", "Пришло время действия", "Верь в себя и получится",
            "Ожидай сюрприза", "Шансы на успех велики", "Жди подходящего момента", 
            "Успех на горизонте", "Все зависит от обстоятельств", "Доверься процессу", 
            "Ты к этому готов", "Судьба не даёт случайных возможностей", "Слушай знаки",
            "Это может изменить всё", "Удача на твоей стороне", "Ожидай положительных перемен"]

    async def ballcmd(self, message):
        """<вопрос>"""
        text = utils.get_args_raw(message)
        if not text:
            await message.edit('<b>Нет вопроса</b>')
            return
        
        prediction = random.choice(self.predictions)
        ball = f"🗣️<code>{text}</code>\n<b>🔮{prediction}</b>"
        await message.edit(ball)